# Task 2:
# Список "sys.path" ініціалізується зі змінної оточення PYTHONPATH.
# Чи можна його змінити з Python? - Так, змінити можна.
# Якщо так, то чи впливає це на те, де Python шукає файли модулів? - Так, може впливати.
# Виконайте кілька інтерактивних тестів, щоб з'ясувати це.

import sys
print(sys.path)

# Змінюємо порядок елементів в списку директорій:
sys.path.reverse()
print(sys.path)

# Замінюємо перший елемент списку своєю адресою директорії:
sys.path[0] = 'C:\\Users\\Admin\\OneDrive\\Desktop\\HomeWork\\Lesson10'
print(sys.path)