
with open('simvols.txt', 'r') as my_file:
    chrs = my_file.read(7)      # В дужках можна вказати кількість символів, які потрібно зчитати
    print(chrs)

    position = my_file.tell()   # Позиція в файлі, на якій ми зупинились
    print(f'Позиція в файлі: {position}')

# За допомогою метода .seek(offset[from]) можна змінювати позицію в файлі
# offset вказує на скільки символів (або байтів) потрібно змінити позицію
# from вказує на позицію посилання, відносно якої потрібно переміститись:
    # 0 - з початку файлу; 1 - поточна позиція; 2 - від кінця файлу
    new_position = my_file.seek(3, 0)
    chrs = my_file.read(6)
    print(chrs)