# ЗАПИС В ФАЙЛ weekdays.txt списку значень построково (якщо файл не існує - його буде створено):
# open(файл, режим='r', buffering=-1, encoding=None, errors=None, newline=None, closefd=True, opener=None)
#     --------- ---------------------------------------------------------------
# 'r'	читання (файл має існувати)
# 'w'	запис (створює файл або перезаписує існуючий)
# 'a'	дописування (створює файл, якщо не існує)
# 'x'	створення нового файлу (помилка, якщо існує)
# 'b'	бінарний режим (наприклад, для зображень)
# 't'	текстовий режим (за замовчуванням)
# '+'	читання та запис одночасно

d = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']

# Відкриття файлу 'weekdays.txt' для запису як змінна my_file
# та запис в нього рядка тексту
# (попередньо об'єднуємо елементи списку в рядок через кому за допомогою .join):
with open('weekdays.txt', 'w') as my_file:
    my_file.write(', '.join(d))

# Відкриття файлу 'weekdays.txt' для запису як змінна my_file
# та запис в нього елементів списку построчно
# (додаємо в кінці строки символ переходу на новий рядок '\n'):
with open('weekdays.txt', 'w') as my_file:
    for day in d:
        my_file.writelines(day + '\n')