# Task 2:
print('Task 2:')

while True:
    # Отримуємо відповідь від користувача
    x = input('Введіть телефонний номер: ')

    # Перевіряемо, чи містить відповідь користувача лише числові символи
    # Далі перевіряємо чи кількість цифр більше, меньше чи дорівнює 10
    # та друкуємо повідомлення
    if not x.isnumeric():
        print('Телефонний номер має містити лише цифрові символи!')
        #continue
    elif len(x) > 10:
        print('Телефонний номер має містити не більше 10 цифр!')
        #continue
    elif len(x) < 10:
        print('Телефонний номер має містити не меньше 10 цифр!')
    else:
        print('Ви вказали телефонний номер: {} в правильному форматі!'.format(x))
        break

