# Task 3:
print('Task 3:')

# Умова
s = 'Скільки буде (12 + 5)?  Ваша відповідь: '

# Правильна відповідь
a = 17

while True:
    # Отримуємо відповідь від користувача (вона є рядком)
    x = input(s)

    # Перевіряемо, чи містить відповідь користувача лише числові символи
    # а також чи правильна відповідь і друкуємо повідомлення
    if not x.isdigit():
        print('Відповідь має містити лише цифрові символи!')
        #continue
    elif int(x) != a:
        print('Відповідь невірна!')
        #continue
    else:
        print('Вірно, 12 + 5 = {}!'.format(x))
        break
        
    
