from X_project.my_dates_funcs import *
from X_project.PAYS_DATES_LIST import *

# Початкова дата - дата відкриття договору (поки використовуємо сьогоднішню дату):
Начальна_дата = datetime.today().date()
# Start_date = date(2025, 7,31)   # А якщо в останній день місяця?
# День щомісячної оплати
День_оплати = 15
# Допустима різниця між початковою датою договору та датою першої оплати (не менше):
Допустима_кількість_днів_до_першої_оплати = 7
# Термін дії договору
Термін_дії_договору = 12
# Сума кредиту:
Сума = 30000
# Відсоткова ставка
Процент = 0.12

список_платежів = f_цикл_платежів(Начальна_дата, Сума, Термін_дії_договору, День_оплати, Процент, Допустима_кількість_днів_до_першої_оплати)
for i in список_платежів:
    print(i)



