from X_project.my_dates_funcs import *
# ===========================================================
# Використовуємо функцію PAYS_DATES_LIST для отримання списку усіх ключових дат договору
# Початкові дані:   start_date (дата відкриття договору)
#                   srok (срок дії договору),
#                   day_of_pay (день оплати),
#                   delta_days (допустима різниця між початковою датою договору та датою першої оплати)
# ===========================================================


def PAYS_DATES_LIST(start_date, srok, day_of_pay, delta_days = 10):
    """Функція, що повертає список усіх ключових дат договору:
    [Дата відкриття договору, Дата першої оплати, Дата другої оплати, ..., Дата останньої оплати]"""

    # Дату першої оплати отримуємо окремо з використанням декоратора (присвоюємо змінній temp_func декоратор date_decorator1):
    temp_func = first_pay_decorator(add_months, start_date, day_of_pay, delta_days)
    # Дата першої оплати:
    first_pay_date = temp_func(start_date, day_of_pay, 1)
    # Дата останньої оплати за договором:
    last_pay_date = add_months(start_date, day_of_pay, srok)
    # Отримуємо список дат: перша дата - це дата відкриття договору, наступні - дати оплати...
    # Перша дата - дата відкриття договору
    LIST_DATES = [start_date]
    # Друга дата - дата першої оплати
    LIST_DATES.append(first_pay_date)
    # Заносимо в список наступні дати оплат:
    temp_date = first_pay_date
    for i in range(srok):
        temp_date = add_months(temp_date, day_of_pay, 1)
        if temp_date <= last_pay_date:
            LIST_DATES.append(temp_date)
    return LIST_DATES




# Дата відкриття договору (поки використовуємо сьогоднішню дату):
start_date = datetime.today().date()
start_date = date(2025, 7,31)   # А якщо в останній день місяця?

# День щомісячної оплати
day_of_pay = 3

# Якщо допустити випадок, коли договір відкривається в останні дні місяця (наприклад, 31 числа),
# а перша оплата за умовами договору має бути в перші дні місяця (наприклад 1 числа), то може скластися ситуація
# коли перша оплата має бути буквально на наступний день; або через кілька днів від моменту відкриття договору.
# Тому є сенс в таких випадках пропонувати клієнту змістити дату першої оплати на пізнішу дату....
# Допустима різниця між початковою датою договору та датою першої оплати (не менше):
# delta_days = 7

# Термін дії договору
srok = 12

# Друк списку дат для наочності
my_list = PAYS_DATES_LIST(start_date, srok, day_of_pay)
for d in my_list:
    print(format_date_ua(d))