# Task 2:

# Імпортуємо модуль random
# Створюємо два пусті списки list_1 та list_2
#
# В циклі while (поки кількість елементів списку list_1 (а також і в list_2) не стане 10):
#   генеруємо випадкове число та заносимо його в хвіст кожного списку,
# далі перетворюємо кожен список в множину SET (щоб позбавитись дублікатів),
# методом intersection визначаємо спільні числа в обох множинах
# і перетворюємо в підсумковий список list_3.
# Для наочністі друкуємо всі три списки.

import random

list_1 = []
list_2 = []

while len(list_1) != 10:
    list_1.append(random.randint(1,10))
    list_2.append(random.randint(1,10))
list_3 = list(set(list_1) & set(list_2))

print('Task 2:')
print(f'Список 1: {list_1}')
print(f'Список 2: {list_2}')
print(f'Список спільних чисел без дублікатів: {list_3}')

