# Task 3:

# Створюємо два списки:
# 1) my_list (пустий)
# 2) list_100, в який за допомогою функції range(100) заносимо ряд чисел від 1 до 100.
#
# В циклі while (поки кількість елементів списку list_100 більше ніж 0):
#   перевіряємо кожний останній елемент списку list_100,
#       якщо він ділиться на 7 без залишку та не є кратними 5 (тобто ділиться на 5 с залишком):
#           через метод .pop переносимо останній елемент з списку list_100 в хвіст списку my_list
#       інакше - видаляємо цей елемент.
# Для наочністі перевертаємо список my_list і друкуємо повідомлення.

my_list = []
list_100 = list(range(1, 100))

while len(list_100) > 0:
    if list_100[-1] % 7 == 0 and list_100[-1] % 5 != 0:
        my_list.append(list_100.pop())
    else:
        list_100.remove(list_100[-1])
my_list.reverse()

print('Task 3:')
print(f"Список чисел від 1 до 100, які діляться на 7, але не є кратними 5:\n{my_list}")