# Цифровий корінь - це рекурсивна сума всіх цифр числа.
# За заданим n знайдіть суму цифр числа n.
# Якщо це значення має більше однієї цифри, продовжуйте зменшувати таким чином,
# доки не отримаєте одноцифрове число. На вхід виводиться ціле невід'ємне число.
# 16  -->  1 + 6 = 7
# 942  -->  9 + 4 + 2 = 15  -->  1 + 5 = 6
# 132189  -->  1 + 3 + 2 + 1 + 8 + 9 = 24  -->  2 + 4 = 6
# 493193  -->  4 + 9 + 3 + 1 + 9 + 3 = 29  -->  2 + 9 = 11  -->  1 + 1 = 2


def digital_root(n):
    sum = n % 10

    while n % 10 > 0:
        # digital_root(digital_root(n))
        # global sum
        n = n % 10
        if n == 0:
            return n
        else:
            n += digital_root(n // 10)
            return n



print(digital_root(132189))