# Напишіть програму на мові Python для визначення кількості локальних змінних, оголошених у функції.

# Якась функція для прикладу, в якій оголошено 3 локальних змінних:
def some_function():
    a = 0
    b = {}
    c = []

# Функція, що приймає в якості аргумента іншу функцію,
# та повертає кількість локальних змінних, оголошених у цій функції:
# Метод co_nlocals вбудованої функції __code__ (підказано ChatGPT)
def func_vars(func):
    return func.__code__.co_nlocals

print(f'Кількість локальних змінних, оголошених у функції {some_function.__name__} = {func_vars(some_function)}')

