# Task 2:
# Напишіть функцію, яка отримує два числа від користувача через input(),
# викликає числа a та b, а потім повертає значення квадрату a, поділеного на b.
# Побудуйте блок try-except, який перехоплює виключення,
# якщо два значення, передані вхідною функцією, не є числами,
# і якщо значення b дорівнює нулю (на нуль ділити не можна).

def divide_square(a, b):
    try:
        a = int(a)
        b = int(b)
        return '(X^2)/Y = ' + str((a * a) / b)
    except ValueError:
        return 'Введено некоректні значення! Мають бути числа!'
    except ZeroDivisionError:
        return 'Ділення на ноль! Друге число має бути більше нуля!'

x, y = input('Для обчислення (X^2)/Y, введіть два числа (X та Y) через пробіл: ').split()
print(divide_square(x, y))

