# Task 2:
# Реалізуйте клас Mathematician, який є допоміжним класом для виконання математичних операцій над списками
# Клас не приймає жодних атрибутів і має лише методи:
# - square_nums (отримує список цілих чисел і повертає список квадратів)
# - remove_positives (отримує список цілих чисел і повертає його без додатних чисел)
# - filter_leaps (отримує список дат (цілих чисел) і видаляє ті, які не є "високосними")

class Mathematician:
    def __init__(self):
        pass

    def square_nums(self, list1):
        return [i**2 for i in list1]

    def remove_positives(self, list1):
        return [i for i in list1 if i < 0]

    def filter_leaps(self, list1):
        return [i for i in list1 if i % 4 == 0 and not (i % 100 == 0 and i % 400 != 0)]

m = Mathematician()
print(m.square_nums([7, 11, 5, 4]) == [49, 121, 25, 16])                # True
print(m.remove_positives([26, -11, -8, 13, -90]) == [-11, -8, -90])     # True
print(m.filter_leaps([2001, 1884, 1995, 2003, 2020]) == [1884, 2020])   # True


# Додаткова перевірка, цього немає в заданні!
# Щоб визначити, чи є рік високосним, потрібно перевірити, чи ділиться він на 4.
# Якщо ділиться, то це високосний рік,
# за винятком випадків, коли він ділиться на 100, але не ділиться на 400.
# Наприклад, 1600, 2000 рік був високосним, а 1700, 1800, 1900 - ні.

print(m.filter_leaps([1600, 1700, 1800, 1900, 2000, 2005, 2011, 2020, 2021, 2024]))     # [1600, 2000, 2020, 2024]